#include <common.h>
////////////  AUD_TEST 
/*********** audio global*********/

typedef unsigned int UINT32;
typedef unsigned char UINT8;



#if 1
typedef struct
{
    // GROUP 000 : Chip Information
    UINT32  stamp                                 ; // 00  (ADDR : 0x9C00_0000)
    UINT32  emulation                             ; // 01  (ADDR : 0x9C00_0004)
    UINT32  G000_reserved_2                       ; // 02  (ADDR : 0x9C00_0008)
    UINT32  G000_reserved_3                       ; // 03  (ADDR : 0x9C00_000C)
    UINT32  clk_sel0                              ; // 04  (ADDR : 0x9C00_0010)
    UINT32  clk_sel1                              ; // 05  (ADDR : 0x9C00_0014)
    UINT32  sspll_cfg                             ; // 06  (ADDR : 0x9C00_0018)
    UINT32  clken0                                ; // 07  (ADDR : 0x9C00_001C)
    UINT32  clken1                                ; // 08  (ADDR : 0x9C00_0020)
    UINT32  clken2                                ; // 09  (ADDR : 0x9C00_0024)
    UINT32  clken3                                ; // 10  (ADDR : 0x9C00_0028)
    UINT32  clken4                                ; // 11  (ADDR : 0x9C00_002C)
    UINT32  gclken0                               ; // 12  (ADDR : 0x9C00_0030)
    UINT32  gclken1                               ; // 13  (ADDR : 0x9C00_0034)
    UINT32  gclken2                               ; // 14  (ADDR : 0x9C00_0038)
    UINT32  gclken3                               ; // 15  (ADDR : 0x9C00_003C)
    UINT32  gclken4                               ; // 16  (ADDR : 0x9C00_0040)
    UINT32  reset0                                ; // 17  (ADDR : 0x9C00_0044)
    UINT32  reset1                                ; // 18  (ADDR : 0x9C00_0048)
    UINT32  reset2                                ; // 19  (ADDR : 0x9C00_004C)
    UINT32  reset3                                ; // 20  (ADDR : 0x9C00_0050)
    UINT32  reset4                                ; // 21  (ADDR : 0x9C00_0054)
    UINT32  pwr_iso                               ; // 22  (ADDR : 0x9C00_0058)
    UINT32  pwr_ctl                               ; // 23  (ADDR : 0x9C00_005C)
    UINT32  hw_bo0                                ; // 24  (ADDR : 0x9C00_0060)
    UINT32  hw_bo1                                ; // 25  (ADDR : 0x9C00_0064)
    UINT32  hw_bo2                                ; // 26  (ADDR : 0x9C00_0068)
    UINT32  hw_bo3                                ; // 27  (ADDR : 0x9C00_006C)
    UINT32  hw_cfg                                ; // 28  (ADDR : 0x9C00_0070)
    UINT32  hw_cfg_chg                            ; // 29  (ADDR : 0x9C00_0074)
    UINT32  G000_reserved_30                      ; // 30  (ADDR : 0x9C00_0078)
    UINT32  show_bo_stamp                         ; // 31  (ADDR : 0x9C00_007C)

    // Group 001 : MOON1
    UINT32  rf_sft_cfg0                           ; // 00  (ADDR : 0x9C00_0080)
    UINT32  rf_sft_cfg1                           ; // 01  (ADDR : 0x9C00_0084)
    UINT32  rf_sft_cfg2                           ; // 02  (ADDR : 0x9C00_0088)
    UINT32  rf_sft_cfg3                           ; // 03  (ADDR : 0x9C00_008C)
    UINT32  rf_sft_cfg4                           ; // 04  (ADDR : 0x9C00_0090)
    UINT32  rf_sft_cfg5                           ; // 05  (ADDR : 0x9C00_0094)
    UINT32  rf_sft_cfg6                           ; // 06  (ADDR : 0x9C00_0098)
    UINT32  rf_sft_cfg7                           ; // 07  (ADDR : 0x9C00_009C)
    UINT32  rf_sft_cfg8                           ; // 08  (ADDR : 0x9C00_00A0)
    UINT32  rf_sft_cfg9                           ; // 09  (ADDR : 0x9C00_00A4)
    UINT32  rf_sft_cfg10                          ; // 10  (ADDR : 0x9C00_00A8)
    UINT32  rf_sft_cfg11                          ; // 11  (ADDR : 0x9C00_00AC)
    UINT32  rf_sft_cfg12                          ; // 12  (ADDR : 0x9C00_00B0)
    UINT32  rf_sft_cfg13                          ; // 13  (ADDR : 0x9C00_00B4)
    UINT32  rf_sft_cfg14                          ; // 14  (ADDR : 0x9C00_00B8)
    UINT32  rf_sft_cfg15                          ; // 15  (ADDR : 0x9C00_00BC)
    UINT32  rf_sft_cfg16                          ; // 16  (ADDR : 0x9C00_00C0)
    UINT32  rf_sft_cfg17                          ; // 17  (ADDR : 0x9C00_00C4)
    UINT32  rf_sft_cfg18                          ; // 18  (ADDR : 0x9C00_00C8)
    UINT32  rf_sft_cfg19                          ; // 19  (ADDR : 0x9C00_00CC)
    UINT32  rf_sft_cfg20                          ; // 20  (ADDR : 0x9C00_00D0)
    UINT32  rf_sft_cfg21                          ; // 21  (ADDR : 0x9C00_00D4)
    UINT32  rf_sft_cfg22                          ; // 22  (ADDR : 0x9C00_00D8)
    UINT32  rf_sft_cfg23                          ; // 23  (ADDR : 0x9C00_00DC)
    UINT32  rf_sft_cfg24                          ; // 24  (ADDR : 0x9C00_00E0)
    UINT32  rf_sft_cfg25                          ; // 25  (ADDR : 0x9C00_00E4)
    UINT32  rf_sft_cfg26                          ; // 26  (ADDR : 0x9C00_00E8)
    UINT32  rf_sft_cfg27                          ; // 27  (ADDR : 0x9C00_00EC)
    UINT32  rf_sft_cfg28                          ; // 28  (ADDR : 0x9C00_00F0)
    UINT32  rf_sft_cfg29                          ; // 29  (ADDR : 0x9C00_00F4)
    UINT32  rf_sft_cfg30                          ; // 30  (ADDR : 0x9C00_00F8)
    UINT32  rf_sft_cfg31                          ; // 31  (ADDR : 0x9C00_00FC)

    // Group 002 : Reserved
    UINT32  rf_sft_cfg32                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg33                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg34                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg35                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg36                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg37                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg38                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg39                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg40                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg41                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg42                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg43                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg44                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  rf_sft_cfg45                          ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)
    UINT32  G002_RESERVED[18]                     ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)

    // Group 003 : Reserved
    UINT32  G003_RESERVED[32]                     ; //     (ADDR : 0x9C00_0180) ~ (ADDR : 0x9C00_01FC)

    // Group 004 : PAD_CTL
    UINT32  rf_pad_ctl0                           ; // 00  (ADDR : 0x9C00_0200)
    UINT32  rf_pad_ctl1                           ; // 01  (ADDR : 0x9C00_0204)
    UINT32  rf_pad_ctl2                           ; // 02  (ADDR : 0x9C00_0208)
    UINT32  rf_pad_ctl3                           ; // 03  (ADDR : 0x9C00_020C)
    UINT32  rf_pad_ctl4                           ; // 04  (ADDR : 0x9C00_0210)
    UINT32  rf_pad_ctl5                           ; // 05  (ADDR : 0x9C00_0214)
    UINT32  rf_pad_ctl6                           ; // 06  (ADDR : 0x9C00_0218)
    UINT32  rf_pad_ctl7                           ; // 07  (ADDR : 0x9C00_021C)
    UINT32  rf_pad_ctl8                           ; // 08  (ADDR : 0x9C00_0220)
    UINT32  rf_pad_ctl9                           ; // 09  (ADDR : 0x9C00_0224)
    UINT32  rf_pad_ctl10                          ; // 10  (ADDR : 0x9C00_0228)
    UINT32  rf_pad_ctl11                          ; // 11  (ADDR : 0x9C00_022C)
    UINT32  rf_pad_ctl12                          ; // 12  (ADDR : 0x9C00_0230)
    UINT32  rf_pad_ctl13                          ; // 13  (ADDR : 0x9C00_0234)
    UINT32  rf_pad_ctl14                          ; // 14  (ADDR : 0x9C00_0238)
    UINT32  rf_pad_ctl15                          ; // 15  (ADDR : 0x9C00_023C)
    UINT32  rf_pad_ctl16                          ; // 16  (ADDR : 0x9C00_0240)
    UINT32  rf_pad_ctl17                          ; // 17  (ADDR : 0x9C00_0244)
    UINT32  rf_pad_ctl18                          ; // 18  (ADDR : 0x9C00_0248)
    UINT32  rf_pad_ctl19                          ; // 19  (ADDR : 0x9C00_024C)
    UINT32  rf_pad_ctl20                          ; // 20  (ADDR : 0x9C00_0250)
    UINT32  rf_pad_ctl21                          ; // 21  (ADDR : 0x9C00_0254)
    UINT32  rf_pad_ctl22                          ; // 22  (ADDR : 0x9C00_0258)
    UINT32  rf_pad_ctl23                          ; // 23  (ADDR : 0x9C00_025C)
    UINT32  rf_pad_ctl24                          ; // 24  (ADDR : 0x9C00_0260)
    UINT32  gpio_first[6]			  ;
    UINT32  rf_pad_ctl31                          ; // 31  (ADDR : 0x9C00_027C)

    // Group 005 : GPIOXT
    UINT32 gpio_master[8];                        
    UINT32 gpio_oe[8];
    UINT32 gpio_out[8];
    UINT32 gpio_in[8];                             //(ADDR : 0x9C00_0280) ~ (ADDR : 0x9C00_02FC)

    // Group 006 : Reserved
    UINT32  G006_RESERVED[32]                     ;//(ADDR : 0x9C00_0300) ~ (ADDR : 0x9C00_037C)

    // Group 007 : PAD_CTRL1
    UINT32  G007_PAD_CTRL1[32]                    ;//(ADDR : 0x9C00_0380) ~ (ADDR : 0x9C00_03FC)

    // Group 008 : IOP
    UINT32  iop_control                           ; //
    UINT32  iop_status                            ; //
    UINT32  iop_bp                                ; //
    UINT32  iop_regsel                            ; //
    UINT32  iop_regout                            ; //
    UINT32  iop_memlimit                          ; //
//  UINT32  reserved[2]                           ; //
    UINT32  iop_resume_pcl                        ; //
    UINT32  iop_resume_pch                        ; //
    UINT32  iop_data[12]                          ; //
    UINT32  iop_lbus_offset_ext                   ; //
    UINT32  iop_lbus_offset                       ; //
    UINT32  iop_lbus_control                      ; //
    UINT32  iop_lbus_offset2_lsb                  ; //
    UINT32  iop_lbus_offset2                      ; //
    UINT32  iop_direct_adr                        ; //
    UINT32  g8_reserved[6]                        ; //

    // Group 009 : ARM926 interrupt
    UINT32  a926_intr_type[7]                     ;
    UINT32  a926_intr_polarity[7]                 ;
    UINT32  a926_priority[7]                      ;
    UINT32  a926_intr_mask[7]                     ;
    UINT32  G009_RESERVED[4]                      ;

    // Group 010 : ARM926 interrupt
    UINT32  a926_intr_clr[7]                      ;
    UINT32  masked_a926_fiqs[7]                   ;
    UINT32  masked_a926_irqs[7]                   ;
    UINT32  G010_RESERVED[11]                     ;

    // Group 011 : TSET
    UINT32  G011_TSET[32]                         ;

    // Group 012 : STC
    UINT32  stc_15_0                              ; // 00  384
    UINT32  stc_31_16                             ; // 01  385
    UINT32  stc_32                                ; // 02  386
    UINT32  stc_divisor                           ; // 03  387
    UINT32  rtc_15_0                              ; // 04  388
    UINT32  rtc_31_16                             ; // 05  389
    UINT32  rtc_divisor                           ; // 06  390
    UINT32  stc_config                            ; // 07  391
    UINT32  timer0_ctrl                           ; // 08  392
    UINT32  timer0_cnt                            ; // 09  393
    UINT32  timer1_ctrl                           ; // 0a  394
    UINT32  timer1_cnt                            ; // 0b  395
    UINT32  timerw_ctrl                           ; // 0c  396
    UINT32  timerw_cnt                            ; // 0d  397
    UINT32  g12_unused_1[2]                       ; // 0e  398~399
    UINT32  timer2_ctrl                           ; // 10  400
    UINT32  timer2_divisor                        ; // 11  401
    UINT32  timer2_reload                         ; // 12  402
    UINT32  timer2_cnt                            ; // 13  403
    UINT32  timer3_ctrl                           ; // 14  404
    UINT32  timer3_divisor                        ; // 15  405
    UINT32  timer3_reload                         ; // 16  406
    UINT32  timer3_cnt                            ; // 17  407
    UINT32  stcl_0                                ; // 18  408
    UINT32  stcl_1                                ; // 19  409
    UINT32  stcl_2                                ; // 1a  410
    UINT32  atc_0                                 ; // 1b  411
    UINT32  atc_1                                 ; // 1c  412
    UINT32  atc_2                                 ; // 1d  413
    UINT32  g12_reserved[2]                       ; // 1e  414

    // Group 013 : BR_WRAPPER
    UINT32  G013_BR_WRAPPER[32]                   ;

    // Group 014 : DUMMY_MASTER
    UINT32  dummy0_op_mode                        ; // 00  (ADDR : 0x9C00_0700)
    UINT32  dummy0_addr_base                      ; // 01  (ADDR : 0x9C00_0704)
    UINT32  dummy0_addr_offset                    ; // 02  (ADDR : 0x9C00_0708)
    UINT32  dummy0_control                        ; // 03  (ADDR : 0x9C00_070C)
    UINT32  dummy0_urgent                         ; // 04  (ADDR : 0x9C00_0710)
    UINT32  dummy0_request_period                 ; // 05  (ADDR : 0x9C00_0714)
    UINT32  G14_reserved_6                        ; // 06  (ADDR : 0x9C00_0718)
    UINT32  dummy0_error                          ; // 07  (ADDR : 0x9C00_071C)
    UINT32  dummy0_runtime_l                      ; // 08  (ADDR : 0x9C00_0720)
    UINT32  dummy0_runtime_h                      ; // 09  (ADDR : 0x9C00_0724)
    UINT32  dummy0_data_count_l                   ; // 10  (ADDR : 0x9C00_0728)
    UINT32  dummy0_data_count_h                   ; // 11  (ADDR : 0x9C00_072C)
    UINT32  dummy0_mdata_count_l                  ; // 12  (ADDR : 0x9C00_0730)
    UINT32  dummy0_mdata_count_h                  ; // 13  (ADDR : 0x9C00_0734)
    UINT32  dummy0_sdata_count_l                  ; // 14  (ADDR : 0x9C00_0738)
    UINT32  dummy0_sdata_count_h                  ; // 15  (ADDR : 0x9C00_073C)
    UINT32  dummy1_op_mode                        ; // 16  (ADDR : 0x9C00_0740)
    UINT32  dummy1_addr_base                      ; // 17  (ADDR : 0x9C00_0744)
    UINT32  dummy1_addr_offset                    ; // 18  (ADDR : 0x9C00_0748)
    UINT32  dummy1_control                        ; // 19  (ADDR : 0x9C00_074C)
    UINT32  dummy1_urgent                         ; // 20  (ADDR : 0x9C00_0750)
    UINT32  dummy1_request_period                 ; // 21  (ADDR : 0x9C00_0754)
    UINT32  G14_reserved_16                       ; // 22  (ADDR : 0x9C00_0758)
    UINT32  dummy1_error                          ; // 23  (ADDR : 0x9C00_075C)
    UINT32  dummy1_runtime_l                      ; // 24  (ADDR : 0x9C00_0760)
    UINT32  dummy1_runtime_h                      ; // 25  (ADDR : 0x9C00_0764)
    UINT32  dummy1_data_count_l                   ; // 26  (ADDR : 0x9C00_0768)
    UINT32  dummy1_data_count_h                   ; // 27  (ADDR : 0x9C00_076C)
    UINT32  dummy1_mdata_count_l                  ; // 28  (ADDR : 0x9C00_0770)
    UINT32  dummy1_mdata_count_h                  ; // 29  (ADDR : 0x9C00_0774)
    UINT32  dummy1_sdata_count_l                  ; // 30  (ADDR : 0x9C00_0778)
    UINT32  dummy1_sdata_count_h                  ; // 31  (ADDR : 0x9C00_077C)

    // Group 015 : ACHIP interrupt
    UINT32  achip_intr_type[7]                    ;
    UINT32  achip_intr_polarity[7]                ;
    UINT32  achip_priority[7]                     ;
    UINT32  achip_intr_mask[7]                    ;
    UINT32  G015_RESERVED[4]                      ;

    // Group 016 : UART2
    UINT32  uart2_data                            ; // 00  (ADDR : 0x9C00_0900)
    UINT32  uart2_lsr                             ; // 01  (ADDR : 0x9C00_0904)
    UINT32  uart2_msr                             ; // 02  (ADDR : 0x9C00_0908)
    UINT32  uart2_lcr                             ; // 03  (ADDR : 0x9C00_090C)
    UINT32  uart2_mcr                             ; // 04  (ADDR : 0x9C00_0910)
    UINT32  uart2_div_l                           ; // 05  (ADDR : 0x9C00_0914)
    UINT32  uart2_div_h                           ; // 06  (ADDR : 0x9C00_0918)
    UINT32  uart2_isc                             ; // 07  (ADDR : 0x9C00_091C)
    UINT32  uart2_tx_residue                      ; // 08  (ADDR : 0x9C00_0920)
    UINT32  uart2_rx_residue                      ; // 09  (ADDR : 0x9C00_0924)
    UINT32  uart2_rxfifo_thr                      ; // 10  (ADDR : 0x9C00_0928)
    UINT32  G016_reserved[21]                     ;

    // Group 017 : UART3
    UINT32  uart3_data                            ; // 00  (ADDR : 0x9C00_0880)
    UINT32  uart3_lsr                             ; // 01  (ADDR : 0x9C00_0884)
    UINT32  uart3_msr                             ; // 02  (ADDR : 0x9C00_0888)
    UINT32  uart3_lcr                             ; // 03  (ADDR : 0x9C00_088C)
    UINT32  uart3_mcr                             ; // 04  (ADDR : 0x9C00_0890)
    UINT32  uart3_div_l                           ; // 05  (ADDR : 0x9C00_0894)
    UINT32  uart3_div_h                           ; // 06  (ADDR : 0x9C00_0898)
    UINT32  uart3_isc                             ; // 07  (ADDR : 0x9C00_089C)
    UINT32  uart3_tx_residue                      ; // 08  (ADDR : 0x9C00_08A0)
    UINT32  uart3_rx_residue                      ; // 09  (ADDR : 0x9C00_08A4)
    UINT32  uart3_rxfifo_thr                      ; // 10  (ADDR : 0x9C00_08A8)
    UINT32  G017_reserved[21]                     ; //     (ADDR : 0x9C00_08AC)

    // Group 018 : UART0
    UINT32  uart0_data                            ; // 00  (ADDR : 0x9C00_0900)
    UINT32  uart0_lsr                             ; // 01  (ADDR : 0x9C00_0904)
    UINT32  uart0_msr                             ; // 02  (ADDR : 0x9C00_0908)
    UINT32  uart0_lcr                             ; // 03  (ADDR : 0x9C00_090C)
    UINT32  uart0_mcr                             ; // 04  (ADDR : 0x9C00_0910)
    UINT32  uart0_div_l                           ; // 05  (ADDR : 0x9C00_0914)
    UINT32  uart0_div_h                           ; // 06  (ADDR : 0x9C00_0918)
    UINT32  uart0_isc                             ; // 07  (ADDR : 0x9C00_091C)
    UINT32  uart0_tx_residue                      ; // 08  (ADDR : 0x9C00_0920)
    UINT32  uart0_rx_residue                      ; // 09  (ADDR : 0x9C00_0924)
    UINT32  uart0_rxfifo_thr                      ; // 10  (ADDR : 0x9C00_0928)
    UINT32  G018_reserved[21]                     ;

    // Group 019 : UART1
    UINT32  uart1_data                            ; // 00  (ADDR : 0x9C00_0900)
    UINT32  uart1_lsr                             ; // 01  (ADDR : 0x9C00_0904)
    UINT32  uart1_msr                             ; // 02  (ADDR : 0x9C00_0908)
    UINT32  uart1_lcr                             ; // 03  (ADDR : 0x9C00_090C)
    UINT32  uart1_mcr                             ; // 04  (ADDR : 0x9C00_0910)
    UINT32  uart1_div_l                           ; // 05  (ADDR : 0x9C00_0914)
    UINT32  uart1_div_h                           ; // 06  (ADDR : 0x9C00_0918)
    UINT32  uart1_isc                             ; // 07  (ADDR : 0x9C00_091C)
    UINT32  uart1_tx_residue                      ; // 08  (ADDR : 0x9C00_0920)
    UINT32  uart1_rx_residue                      ; // 09  (ADDR : 0x9C00_0924)
    UINT32  uart1_rxfifo_thr                      ; // 10  (ADDR : 0x9C00_0928)
    UINT32  G019_reserved[21]                     ;

    // Group 020 : DPLL
    UINT32  G020_DPLL[32]                         ;

    // Group 021 : ACHIP interrupt
    UINT32  achip_intr_clr[7]                     ;
    UINT32  masked_achip_fiqs[7]                  ;
    UINT32  masked_achip_irqs[7]                  ;
    UINT32  G021_RESERVED[11]                     ;

    // Group 022 : SPI_FLASH
    UINT32  spi_ctrl                              ;
    UINT32  spi_wait                              ;
    UINT32  spi_cust_cmd                          ;
    UINT32  spi_addr_low                          ;
    UINT32  spi_addr_high                         ;
    UINT32  spi_data_low                          ;
    UINT32  spi_data_high                         ;
    UINT32  spi_status                            ;
    UINT32  spi_cfg0                              ;
    UINT32  spi_cfg1                              ;
    UINT32  spi_cfg2                              ;
    UINT32  spi_cfg3                              ;
    UINT32  spi_cfg4                              ;
    UINT32  spi_cfg5                              ;
    UINT32  spi_cfg6                              ;
    UINT32  spi_cfg7                              ;
    UINT32  spi_cfg8                              ;
    UINT32  spi_cust_cmd2                         ;
    UINT32  spi_data64                            ;
    UINT32  spi_buf_addr                          ;
    UINT32  spi_status2                           ;
    UINT32  spi_status3                           ;
    UINT32  g22_reserved_0[10]                    ;

    // Group 023 : SPI_FLASH
    UINT32  G023_SPI_FLASH[32]                    ;

    // Group 024 : CB_SWITCH
    UINT32  G024_CB_SWITCH[32]                    ; //     (ADDR : 0x9C00_0C00) ~ (ADDR : 0x9C00_0C7C)

    // Group 025 : PBUS
    UINT32  G025_PBUS[32]                         ; //     (ADDR : 0x9C00_0C80) ~ (ADDR : 0x9C00_0CFC)

    // Group 026 : CB_DMA
    UINT32  cbdma_ver                             ; // 00  (ADDR : 0x9C00_0D00)
    UINT32  cbdma_config                          ; // 01  (ADDR : 0x9C00_0D04)
    UINT32  cbdma_dma_length                      ; // 02  (ADDR : 0x9C00_0D08)
    UINT32  cbdma_src_adr                         ; // 03  (ADDR : 0x9C00_0D0c)
    UINT32  cbdma_des_adr                         ; // 04  (ADDR : 0x9C00_0D10)
    UINT32  cbdma_int_status                      ; // 05  (ADDR : 0x9C00_0D14)
    UINT32  cbdma_int_en                          ; // 06  (ADDR : 0x9C00_0D18)
    UINT32  cbdma_memset_value                    ; // 07  (ADDR : 0x9C00_0D1c)
    UINT32  cbdma_sdram_size                      ; // 08  (ADDR : 0x9C00_0D20)
    UINT32  G026_reserved_09                      ; // 09  (ADDR : 0x9C00_0D24)
    UINT32  cbdma_sg_index                        ; // 10  (ADDR : 0x9C00_0D28)
    UINT32  cbdma_sg_config                       ; // 11  (ADDR : 0x9C00_0D2C)
    UINT32  cbdma_sg_dma_length                   ; // 12  (ADDR : 0x9C00_0D30)
    UINT32  cbdma_sg_src_adr                      ; // 13  (ADDR : 0x9C00_0D34)
    UINT32  cbdma_sg_des_adr                      ; // 14  (ADDR : 0x9C00_0D38)
    UINT32  cbdma_sg_memset_value                 ; // 15  (ADDR : 0x9C00_0D3C)
    UINT32  cbdma_sg_setting                      ; // 16  (ADDR : 0x9C00_0D40)
    UINT32  cbdma_sg_loop_en                      ; // 17  (ADDR : 0x9C00_0D44)
    UINT32  cbdma_sg_loop_sram_src                ; // 18  (ADDR : 0x9C00_0D48)
    UINT32  cbdma_sg_loop_sram_size               ; // 19  (ADDR : 0x9C00_0D4C)
    UINT32  G026_reserved_20                      ; // 20  (ADDR : 0x9C00_0D50)
    UINT32  G026_reserved_21                      ; // 21  (ADDR : 0x9C00_0D54)
    UINT32  G026_reserved_22                      ; // 22  (ADDR : 0x9C00_0D58)
    UINT32  G026_reserved_23                      ; // 23  (ADDR : 0x9C00_0D5C)
    UINT32  G026_reserved_24                      ; // 24  (ADDR : 0x9C00_0D60)
    UINT32  G026_reserved_25                      ; // 25  (ADDR : 0x9C00_0D64)
    UINT32  G026_reserved_26                      ; // 26  (ADDR : 0x9C00_0D68)
    UINT32  G026_reserved_27                      ; // 27  (ADDR : 0x9C00_0D6C)
    UINT32  G026_reserved_28                      ; // 28  (ADDR : 0x9C00_0D70)
    UINT32  G026_reserved_29                      ; // 29  (ADDR : 0x9C00_0D74)
    UINT32  G026_reserved_30                      ; // 30  (ADDR : 0x9C00_0D78)
    UINT32  G026_reserved_31                      ; // 31  (ADDR : 0x9C00_0D7C)

    // Group 027 : CB_DMA1
    UINT32  cbdma1_ver                            ; // 00  (ADDR : 0x9C00_0D00)
    UINT32  cbdma1_config                         ; // 01  (ADDR : 0x9C00_0D04)
    UINT32  cbdma1_dma_length                     ; // 02  (ADDR : 0x9C00_0D08)
    UINT32  cbdma1_src_adr                        ; // 03  (ADDR : 0x9C00_0D0c)
    UINT32  cbdma1_des_adr                        ; // 04  (ADDR : 0x9C00_0D10)
    UINT32  cbdma1_int_status                     ; // 05  (ADDR : 0x9C00_0D14)
    UINT32  cbdma1_int_en                         ; // 06  (ADDR : 0x9C00_0D18)
    UINT32  cbdma1_memset_value                   ; // 07  (ADDR : 0x9C00_0D1c)
    UINT32  cbdma1_sdram_size                     ; // 08  (ADDR : 0x9C00_0D20)
    UINT32  G027_reserved_09                      ; // 09  (ADDR : 0x9C00_0D24)
    UINT32  cbdma1_sg_index                       ; // 10  (ADDR : 0x9C00_0D28)
    UINT32  cbdma1_sg_config                      ; // 11  (ADDR : 0x9C00_0D2C)
    UINT32  cbdma1_sg_dma_length                  ; // 12  (ADDR : 0x9C00_0D30)
    UINT32  cbdma1_sg_src_adr                     ; // 13  (ADDR : 0x9C00_0D34)
    UINT32  cbdma1_sg_des_adr                     ; // 14  (ADDR : 0x9C00_0D38)
    UINT32  cbdma1_sg_memset_value                ; // 15  (ADDR : 0x9C00_0D3C)
    UINT32  cbdma1_sg_setting                     ; // 16  (ADDR : 0x9C00_0D40)
    UINT32  G027_reserved_17                      ; // 17  (ADDR : 0x9C00_0D44)
    UINT32  G027_reserved_18                      ; // 18  (ADDR : 0x9C00_0D48)
    UINT32  G027_reserved_19                      ; // 19  (ADDR : 0x9C00_0D4C)
    UINT32  G027_reserved_20                      ; // 20  (ADDR : 0x9C00_0D50)
    UINT32  G027_reserved_21                      ; // 21  (ADDR : 0x9C00_0D54)
    UINT32  G027_reserved_22                      ; // 22  (ADDR : 0x9C00_0D58)
    UINT32  G027_reserved_23                      ; // 23  (ADDR : 0x9C00_0D5C)
    UINT32  G027_reserved_24                      ; // 24  (ADDR : 0x9C00_0D60)
    UINT32  G027_reserved_25                      ; // 25  (ADDR : 0x9C00_0D64)
    UINT32  G027_reserved_26                      ; // 26  (ADDR : 0x9C00_0D68)
    UINT32  G027_reserved_27                      ; // 27  (ADDR : 0x9C00_0D6C)
    UINT32  G027_reserved_28                      ; // 28  (ADDR : 0x9C00_0D70)
    UINT32  G027_reserved_29                      ; // 29  (ADDR : 0x9C00_0D74)
    UINT32  G027_reserved_30                      ; // 30  (ADDR : 0x9C00_0D78)
    UINT32  G027_reserved_31                      ; // 31  (ADDR : 0x9C00_0D7C)

    // Group 028 : Reserved
    UINT32  G028_RESERVED[32]                     ;

    // Group 029 : MBUS
    UINT32  mbus_setting                          ;
    UINT32  G029_reserved[15]                     ;
    UINT32  mbus_int_en                           ;
    UINT32  mbus_int_status                       ;
    UINT32  mbus_int_addr                         ;
    UINT32  mbus_mx_ab_sel                        ;
    UINT32  mbus_mx_ab_arb_type                   ;
    UINT32  mbus_mx_ab_priority                   ;
    UINT32  G029_reserved1[10]                    ;

    // Group 030 : Reserved
    UINT32  G030_RESERVED[32]                     ;

    // Group 031 : MBUS
    UINT32  mbar0_page_setting                    ;
    UINT32  mbar0_m1_setting                      ;
    UINT32  mbar0_m2_setting                      ;
    UINT32  mbar0_m3_setting                      ;
    UINT32  mbar0_m4_setting                      ;
    UINT32  mbar0_m5_setting                      ;
    UINT32  mbar0_m6_setting                      ;
    UINT32  mbar0_m7_setting                      ;
    UINT32  mbar0_m8_setting                      ;
    UINT32  mbar0_m9_setting                      ;
    UINT32  mbar0_m10_setting                     ;
    UINT32  mbar0_m11_setting                     ;
    UINT32  mbar0_m12_setting                     ;
    UINT32  mbar0_m13_setting                     ;
    UINT32  mbar0_m14_setting                     ;
    UINT32  mbar0_m15_setting                     ;
    UINT32  mbar0_m16_setting                     ;
    UINT32  mbar0_m17_setting                     ;
    UINT32  mbar0_m18_setting                     ;
    UINT32  mbar0_m19_setting                     ;
    UINT32  mbar0_m20_setting                     ;
    UINT32  mbar0_m21_setting                     ;
    UINT32  mbar0_m22_setting                     ;
    UINT32  mbar0_m23_setting                     ;
    UINT32  mbar0_m24_setting                     ;
    UINT32  mbar0_m25_setting                     ;
    UINT32  mbar0_m26_setting                     ;
    UINT32  mbar0_m27_setting                     ;
    UINT32  mbar0_m28_setting                     ;
    UINT32  mbar0_m29_setting                     ;
    UINT32  mbar0_m30_setting                     ;
    UINT32  mbar0_m31_setting                     ;

    // Group 032 : SDCTRL0
    UINT32  G032_SDCTRL0[32]                      ;

    // Group 033 : SDCTRL0
    UINT32  G033_SDCTRL0[32]                      ;

    // Group 034 : SDCTRL0
    UINT32  G034_SDCTRL0[32]                      ;

    // Group 035 : SDCTRL0
    UINT32  G035_SDCTRL0[32]                      ;

    // Group 036 : SDCTRL0 (2DBG)
    UINT32  G036_SDCTRL0[32]                     ;

    // Group 037 : SDCTRL0 (2DBG)
    UINT32  G037_SDCTRL0[32]                     ;

    // Group 038 : SDCTRL0 (2DBG)
    UINT32  G038_SDCTRL0[32]                     ;

    // Group 039 : SDCTRL0 (2DBG)
    UINT32  G039_SDCTRL0[32]                     ;

    // Group 040 : SDCTRL0
    UINT32  G040_SDCTRL0[32]                      ;

    // Group 041 : SDCTRL0
    UINT32  G041_SDCTRL0[32]                      ;

    // Group 042 : SDCTRL0
    UINT32  G042_SDCTRL0[32]                      ;

    // Group 043 : Reserved
    UINT32  G043_RESERVED[32]                     ;
    
    // Group 044 : Reserved
    UINT32  G044_RESERVED[32]                     ;
    
    // Group 045 : Reserved
    UINT32  G045_RESERVED[32]                     ;

    //Group 046 : CEVA DSP
    UINT32  dma0_sram_addr                        ; // 00  
    UINT32  dma0_dram_addr                        ; // 01  
    UINT32  dma0_txsize                           ; // 02  
    UINT32  dma0_control                          ; // 03  
    UINT32  dma0_status                           ; // 04  
    UINT32  dma1_sram_addr                        ; // 05  
    UINT32  dma1_dram_addr                        ; // 06  
    UINT32  dma1_txsize                           ; // 07  
    UINT32  dma1_control                          ; // 08  
    UINT32  dma1_status                           ; // 09  
    UINT32  dma2_sram_addr                        ; // 10  
    UINT32  dma2_dram_addr                        ; // 11  
    UINT32  dma2_txsize                           ; // 12  
    UINT32  dma2_control                          ; // 13  
    UINT32  dma2_status                           ; // 14  
    UINT32  g56_reserved15                        ; // 15  
    UINT32  dsp_inst_page_sw                      ; // 16  
    UINT32  dsp_inst_page0                        ; // 17  
    UINT32  dsp_inst_page1                        ; // 18  
    UINT32  dsp_inst_page2                        ; // 19  
    UINT32  dsp_inst_page3                        ; // 20  
    UINT32  dsp_inst_page4                        ; // 21  
    UINT32  dsp_inst_page5                        ; // 22  
    UINT32  dsp_inst_page6                        ; // 23  
    UINT32  dsp_inst_page7                        ; // 24  
    UINT32  dsp_data_page                         ; // 25  
    UINT32  dsp_rom_page                          ; // 26  
    UINT32  g56_reserved27                        ; // 27  
    UINT32  g56_reserved28                        ; // 28  
    UINT32  g56_reserved29                        ; // 29  
    UINT32  g56_reserved30                        ; // 30  
    UINT32  g56_reserved31                        ; // 31  

    //Group 047 : CEVA DSP
    UINT32  rdif_ctrl                             ; // 00  
    UINT32  rdif_int_ctrl                         ; // 01  
    UINT32  rdif_vint_vector                      ; // 02  
    UINT32  rdif_code_key                         ; // 03  
    UINT32  dsp_status                            ; // 04  
    UINT32  rdif_cfg                              ; // 05  
    UINT32  rdif_oh_ctrl                          ; // 06  
    UINT32  g57_reserved7                         ; // 07  
    UINT32  dsp_timer_ctrl                        ; // 08  
    UINT32  dsp_tcount                            ; // 09  
    UINT32  dsp_tperiod                           ; // 10  
    UINT32  dsp_timer_status                      ; // 11  
    UINT32  g57_reserved12                        ; // 12  
    UINT32  g57_reserved13                        ; // 13  
    UINT32  g57_reserved14                        ; // 14  
    UINT32  g57_reserved15                        ; // 15  
    UINT32  g57_reserved16                        ; // 16  
    UINT32  g57_reserved17                        ; // 17  
    UINT32  g57_reserved18                        ; // 18  
    UINT32  g57_reserved19                        ; // 19  
    UINT32  g57_reserved20                        ; // 20  
    UINT32  g57_reserved21                        ; // 21  
    UINT32  g57_reserved22                        ; // 22  
    UINT32  g57_reserved23                        ; // 23  
    UINT32  g57_reserved24                        ; // 24  
    UINT32  g57_reserved25                        ; // 25  
    UINT32  g57_reserved26                        ; // 26  
    UINT32  g57_reserved27                        ; // 27  
    UINT32  g57_reserved28                        ; // 28  
    UINT32  g57_reserved29                        ; // 29  
    UINT32  g57_reserved30                        ; // 30  
    UINT32  g57_reserved31                        ; // 31  

    //Group 048 : CEVA DSP
    UINT32  dsp_monitor_trigger                   ; // 00  
    UINT32  g58_reserved1                         ; // 01  
    UINT32  dsp_cycle                             ; // 02  
    UINT32  dsp_dma_cnt                           ; // 03  
    UINT32  dsp_cache_nseq_cnt                    ; // 04  
    UINT32  dsp_dma_cycle                         ; // 05  
    UINT32  dsp_max_dma_cycle                     ; // 06  
    UINT32  dsp_min_dma_cycle                     ; // 07  
    UINT32  dsp_cache_acc_cycle                   ; // 08  
    UINT32  dsp_dma_status                        ; // 09  
    UINT32  dsp_error                             ; // 10  
    UINT32  g58_reserved11                        ; // 11  
    UINT32  g58_reserved12                        ; // 12  
    UINT32  g58_reserved13                        ; // 13  
    UINT32  g58_reserved14                        ; // 14  
    UINT32  g58_reserved15                        ; // 15  
    UINT32  ocm_inst_reg                          ; // 16  
    UINT32  ocm_cntl_reg                          ; // 17  
    UINT32  ocm_stat_reg                          ; // 18  
    UINT32  g58_reserved19                        ; // 19  
    UINT32  ocm_data_reg0                         ; // 20  
    UINT32  ocm_data_reg1                         ; // 21  
    UINT32  ocm_data_reg2                         ; // 22  
    UINT32  ocm_data_reg3                         ; // 23  
    UINT32  ocm_data_reg4                         ; // 24  
    UINT32  ocm_data_reg5                         ; // 25  
    UINT32  ocm_data_reg6                         ; // 26  
    UINT32  ocm_data_reg7                         ; // 27  
    UINT32  g58_reserved28                        ; // 28  
    UINT32  g58_reserved29                        ; // 29  
    UINT32  g58_reserved30                        ; // 30  
    UINT32  g58_reserved31                        ; // 31  

    //Group 049 : CEVA DSP
    UINT32  dsp_port0                             ; // 00  
    UINT32  dsp_port1                             ; // 01  
    UINT32  dsp_port2                             ; // 02  
    UINT32  dsp_port3                             ; // 03  
    UINT32  dsp_port4                             ; // 04  
    UINT32  dsp_port5                             ; // 05  
    UINT32  dsp_port6                             ; // 06  
    UINT32  dsp_port7                             ; // 07  
    UINT32  dsp_port8                             ; // 08  
    UINT32  dsp_port9                             ; // 09  
    UINT32  dsp_port10                            ; // 10  
    UINT32  dsp_port11                            ; // 11  
    UINT32  dsp_port12                            ; // 12  
    UINT32  dsp_port13                            ; // 13  
    UINT32  dsp_port14                            ; // 14  
    UINT32  dsp_port15                            ; // 15  
    UINT32  dsp_port16                            ; // 16  
    UINT32  dsp_port17                            ; // 17  
    UINT32  dsp_port18                            ; // 18  
    UINT32  dsp_port19                            ; // 19  
    UINT32  dsp_port20                            ; // 20  
    UINT32  dsp_port21                            ; // 21  
    UINT32  dsp_port22                            ; // 22  
    UINT32  dsp_port23                            ; // 23  
    UINT32  dsp_port24                            ; // 24  
    UINT32  dsp_port25                            ; // 25  
    UINT32  dsp_port26                            ; // 26  
    UINT32  dsp_port27                            ; // 27  
    UINT32  dsp_port28                            ; // 28  
    UINT32  dsp_port29                            ; // 29  
    UINT32  dsp_port30                            ; // 30  
    UINT32  dsp_port31                            ; // 31
    
    // Group 050 : DDR_PHY0
    UINT32  G050_DDR_PHY0[32]                     ;

    // Group 051 : DDR_PHY0
    UINT32  G051_DDR_PHY0[32]                     ;

    // Group 052 : DDR_PHY0
    UINT32  G052_DDR_PHY0[32]                     ;

    // Group 053 : DDR_PHY0
    UINT32  G053_DDR_PHY0[32]                      ;
    
    // Group 054 : Reserved
    UINT32  G054_RESERVED[32]                     ;
    
    // Group 055 : Reserved
    UINT32  G055_DDC0[32]                     ;
    
    // Group 056 : Reserved
    UINT32  G056_RESERVED[32]                     ;
    
    // Group 057 : Reserved
    UINT32  G057_I2CM0[32]                        ;

    // Group 058 : Reserved
    UINT32  G058_I2CM1[32]                        ;

    // Group 059 : Reserved
    UINT32  G059_RESERVED[32]                     ;

    // Group 060 : AUD
    UINT32  audif_ctrl                            ; // 00
    UINT32  aud_enable                            ; // 01
    UINT32  pcm_cfg                               ; // 02
    UINT32  i2s_mute_flag_ctrl                    ; // 03
    UINT32  ext_adc_cfg                           ; // 04
    UINT32  int_dac_ctrl0                         ; // 05
    UINT32  int_adc_ctrl                          ; // 06
    UINT32  adc_in_path_switch                    ; // 07
    UINT32  int_adc_dac_cfg                       ; // 08
    UINT32  G060_reserved_9                       ; // 09
    UINT32  iec_cfg                               ; // 10
    UINT32  iec0_valid_out                        ; // 11
    UINT32  iec0_par0_out                         ; // 12
    UINT32  iec0_par1_out                         ; // 13
    UINT32  iec1_valid_out                        ; // 14
    UINT32  iec1_par0_out                         ; // 15
    UINT32  iec1_par1_out                         ; // 16
    UINT32  iec0_rx_debug_info                    ; // 17
    UINT32  iec0_valid_in                         ; // 18
    UINT32  iec0_par0_in                          ; // 19
    UINT32  iec0_par1_in                          ; // 20
    UINT32  iec1_rx_debug_info                    ; // 21
    UINT32  iec1_valid_in                         ; // 22
    UINT32  iec1_par0_in                          ; // 23
    UINT32  iec1_par1_in                          ; // 24
    UINT32  iec2_rx_debug_info                    ; // 25
    UINT32  iec2_valid_in                         ; // 26
    UINT32  iec2_par0_in                          ; // 27
    UINT32  iec2_par1_in                          ; // 28
    UINT32  G060_reserved_29                      ; // 29
    UINT32  iec_tx_user_wdata                     ; // 30
    UINT32  iec_tx_user_ctrl                      ; // 31

    // Group 061 : AUD
    UINT32  adcp_ch_enable                        ; // 00, ADCPRC Configuration Group 1  
    UINT32  adcp_fubypass                         ; // 01, ADCPRC Configuration Group 2  
    UINT32  adcp_mode_ctrl                        ; // 02, ADCPRC Mode Control  
    UINT32  adcp_init_ctrl                        ; // 03, ADCP Initialization Control  
    UINT32  adcp_coeff_din                        ; // 04, Coefficient Data Input  
    UINT32  adcp_agc_cfg                          ; // 05, ADCPRC AGC Configuration of Ch0/1  
    UINT32  adcp_agc_cfg2                         ; // 06, ADCPRC AGC Configuration of Ch2/3  
    UINT32  adcp_gain_0                           ; // 07, ADCP System Gain1
    UINT32  adcp_gain_1                           ; // 08, ADCP System Gain2
    UINT32  adcp_gain_2                           ; // 09, ADCP System Gain3
    UINT32  adcp_gain_3                           ; // 10, ADCP System Gain4
    UINT32  adcp_risc_gain                        ; // 11, ADCP RISC Gain  
    UINT32  adcp_mic_l                            ; // 12, ADCPRC Microphone - in Left Channel Data  
    UINT32  adcp_mic_r                            ; // 13, ADCPRC Microphone - in Right Channel Data  
    UINT32  adcp_agc_gain                         ; // 14, ADCPRC AGC Gain  
    UINT32  G061_reserved_15                      ; // 15, Reserved  
    UINT32  aud_apt_mode                          ; // 16, Audio Playback Timer Mode  
    UINT32  aud_apt_data                          ; // 17, Audio Playback Timer  
    UINT32  aud_apt_parameter                     ; // 18, Audio Playback Timer Parameter  
    UINT32  G061_reserved_19                      ; // 19, Reserved  
    UINT32  aud_audhwya                           ; // 20, DRAM Base Address Offset  
    UINT32  aud_inc_0                             ; // 21, DMA Counter Increment/Decrement  
    UINT32  aud_delta_0                           ; // 22, Delta Value  
    UINT32  aud_fifo_enable                       ; // 23, Audio FIFO Enable  
    UINT32  aud_fifo_mode                         ; // 24, FIFO Mode Control  
    UINT32  aud_fifo_support                      ; // 25, Supported FIFOs ( Debug Function )  
    UINT32  aud_fifo_reset                        ; // 26, Host FIFO Reset  
    UINT32  aud_chk_ctrl                          ; // 27, Checksum Control ( Debug Function )  
    UINT32  aud_checksum_data                     ; // 28, Checksum Data ( Debug Function )  
    UINT32  aud_chk_tcnt                          ; // 29, Target Count of Checksum ( Debug Function )  
    UINT32  aud_embedded_input_ctrl               ; // 30, Embedded Input Control ( Debug Function )  
    UINT32  aud_misc_ctrl                         ; // 31, Miscellaneous Control  

    // Group 062 : AUD
    UINT32  aud_ext_dac_xck_cfg                   ; // 00
    UINT32  aud_ext_dac_bck_cfg                   ; // 01
    UINT32  aud_iec0_bclk_cfg                     ; // 02
    UINT32  aud_ext_adc_xck_cfg                   ; // 03
    UINT32  aud_ext_adc_bck_cfg                   ; // 04
    UINT32  aud_int_adc_xck_cfg                   ; // 05
    UINT32  G062_reserved_6                       ; // 06
    UINT32  aud_int_dac_xck_cfg                   ; // 07
    UINT32  aud_int_dac_bck_cfg                   ; // 08
    UINT32  aud_iec1_bclk_cfg                     ; // 09
    UINT32  G062_reserved_10                      ; // 10
    UINT32  aud_pcm_iec_bclk_cfg                  ; // 11
    UINT32  aud_xck_osr104_cfg                    ; // 12
    UINT32  aud_hdmi_tx_mclk_cfg                  ; // 13
    UINT32  aud_hdmi_tx_bck_cfg                   ; // 14
    UINT32  hdmi_tx_i2s_cfg                       ; // 15
    UINT32  hdmi_rx_i2s_cfg                       ; // 16
    UINT32  aud_aadc_agc01_cfg0                   ; // 17
    UINT32  aud_aadc_agc01_cfg1                   ; // 18
    UINT32  aud_aadc_agc01_cfg2                   ; // 19
    UINT32  aud_aadc_agc01_cfg3                   ; // 20
    UINT32  int_adc_ctrl3                      	  ; // 21
    UINT32  int_adc_ctrl2                         ; // 22
    UINT32  int_dac_ctrl2                         ; // 23
    UINT32  G062_reserved_24                      ; // 24
    UINT32  int_dac_ctrl1                         ; // 25
    UINT32  G062_reserved_26                      ; // 26
    UINT32  G062_reserved_27                      ; // 27
    UINT32  G062_reserved_28                      ; // 28
    UINT32  G062_reserved_29                      ; // 29
    UINT32  G062_reserved_30                      ; // 30
    UINT32  G062_reserved_31                      ; // 31

    // Group 063 : AUD
    UINT32  aud_bt_ifx_cfg                        ; // 00
    UINT32  aud_bt_i2s_cfg                        ; // 01
    UINT32  aud_bt_xck_cfg                        ; // 02
    UINT32  aud_bt_bck_cfg                        ; // 03
    UINT32  aud_bt_sync_cfg                       ; // 04
    UINT32  G063_reserved_5                       ; // 05
    UINT32  G063_reserved_6                       ; // 06
    UINT32  G063_reserved_7                       ; // 07
    UINT32  aud_pwm_xck_cfg                       ; // 08
    UINT32  aud_pwm_bck_cfg                       ; // 09
    UINT32  G063_reserved_10                      ; // 10
    UINT32  G063_reserved_11                      ; // 11
    UINT32  G063_reserved_12                      ; // 12
    UINT32  G063_reserved_13                      ; // 13
    UINT32  G063_reserved_14                      ; // 14
    UINT32  G063_reserved_15                      ; // 15
    UINT32  G063_reserved_16                      ; // 16
    UINT32  G063_reserved_17                      ; // 17
    UINT32  G063_reserved_18                      ; // 18
    UINT32  G063_reserved_19                      ; // 19
    UINT32  aud_aadc_agc2_cfg0                    ; // 20
    UINT32  aud_aadc_agc2_cfg1                    ; // 21
    UINT32  aud_aadc_agc2_cfg2                    ; // 22
    UINT32  aud_aadc_agc2_cfg3                    ; // 23
    UINT32  aud_opt_test_pat                      ; // 24
    UINT32  aud_sys_status0                       ; // 25
    UINT32  aud_sys_status1                       ; // 26
    UINT32  int_adc_ctrl1                         ; // 27
    UINT32  bt_mute_flag                          ; // 28
    UINT32  cdrpll_losd_ctrl                      ; // 29
    UINT32  G063_reserved_30                      ; // 30
    UINT32  other_config                          ; // 31

    // Group 064 : AUD
    UINT32  aud_a0_base                           ; // 
    UINT32  aud_a0_length                         ; // 
    UINT32  aud_a0_ptr                            ; // 
    UINT32  aud_a0_cnt                            ; // 
    UINT32  aud_a1_base                           ; // 
    UINT32  aud_a1_length                         ; // 
    UINT32  aud_a1_ptr                            ; // 
    UINT32  aud_a1_cnt                            ; // 
    UINT32  aud_a2_base                           ; // 
    UINT32  aud_a2_length                         ; // 
    UINT32  aud_a2_ptr                            ; // 
    UINT32  aud_a2_cnt                            ; // 
    UINT32  aud_a3_base                           ; // 
    UINT32  aud_a3_length                         ; // 
    UINT32  aud_a3_ptr                            ; // 
    UINT32  aud_a3_cnt                            ; // 
